// ДЗ 1

// Створити папку для проекту під назвою genius-homework-1
// Виконати семантичку розмітку сторінки у файлі index.html. Макет сайту для косметологічної клініки Beaty Zone
// Перевірити код на валідність через W3C Validator
// Задати кольори для текстових елементів (посилання, заголовки, текст, тощо ) у файлі styles.css, попередньо задавши до цих елементів описові класи. Також задати колір фону для елементів, де це потрібно
// Усі кольори з макету помістити в CSS-змінні на початку файлу styles.css
// Усі зображення з макету оптимізувати через Squoosh і експортувати в папку images
// Підключити шрифт з Google Fonts на сторінку, або завантажити шрифти локально в проект (краще підключити локально)
// Задати властивості шрифту текстовим елементам

// Як мінімально має виглядати ДЗ-1:
// Від вас вимагається створити семантичну структуру HTML та прописати мінімальні стилі для текстів.
// Також обов’язково:
// Код має проходити перевірку через Validator (посилання є на GitHub).
// Шрифти мають бути коректно підключені (Play, Roboto).
// Зображення повинні мати прямокутну форму (за винятком фонового зображення у вигляді хвилі та зображення в секції Hero).
// На іконки наразі не звертаю уваги, адже зазвичай у першій роботі їх завантажують некоректно — з ними ми детально працюватимемо у другій роботі.
// Також не забуваємо додавати стилі для скидання стандартних стилів браузера (reset або normalize). Ця тема розглядається на уроці 7, дозволяється додавати ці стилі вже в першій роботі (6 урок) — для тих, хто вже має базове розуміння CSS — або ж у другій роботі (11 урок)

// ДЗ 2
// Створити папку для проекту під назвою genius-homework-2.
// Виконати flex-розмітку в кожній секції, шапці та підвалі сторінки.
// Додати внутрішні і зовнішні відступи до елементів, де це потрібно.
// Створити контейнер, який обмежує і вирівнює контент сторінки по центру.
// Додати фонове зображення, градієнт і тінь до елементів, де це потрібно.
// Всі іконки з макету експортувати, оптимізувати через SVGOMG і додати до SVG-спрайту, створеного через IcoMoon (також можна оптимізувати одразу весь спрайт).